{"relation":[["Year","2000","2001","2002","2003","2004","2005","2006","2007","2008"],["Winner","See More Business","Shotgun Willy","Bacchanal","Valley Henry","Shooting Light","Farmer Jack","no race 2006","Kauto Star","Denman"],["Age","10","7","8","8","11","9","","7","8"],["Jockey","Mick Fitzgerald","Joe Tizzard","Mick Fitzgerald","Barry Geraghty","Richard Johnson","Richard Johnson","","Ruby Walsh","Sam Thomas"],["Trainer","Paul Nicholls","Paul Nicholls","Nicky Henderson","Paul Nicholls","Martin Pipe","Philip Hobbs","","Paul Nicholls","Paul Nicholls"]],"pageTitle":"Aon Chase - Wikipedia, the free encyclopedia","title":"","url":"","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{752\u003dIt is one of the principal trial races for the Cheltenham Gold Cup and takes its name from the sponsors Aon Group Ltd. It was first run in 2000 as a Class B race, upgrading to Listed status in 2002 and to Grade 2 in 2003., 1455\u003dThe Aon Chase is a Grade 2 National Hunt chase in the United Kingdom for five-year-old and above horses. It is run over a distance of 3 miles (4,828 metres) at Newbury Racecourse in February. There are eighteen fences to be jumped in the race.}","lastModified":"","textBeforeTable":"Amateur jockeys indicated by \"Mr\". [edit] Winners It is one of the principal trial races for the Cheltenham Gold Cup and takes its name from the sponsors Aon Group Ltd. It was first run in 2000 as a Class B race, upgrading to Listed status in 2002 and to Grade 2 in 2003. The Aon Chase is a Grade 2 National Hunt chase in the United Kingdom for five-year-old and above horses. It is run over a distance of 3 miles (4,828 metres) at Newbury Racecourse in February. There are eighteen fences to be jumped in the race. From Wikipedia, the free encyclopedia Aon Chase","textAfterTable":"[edit] References Racing Post: 2000, 2001, 2002, 2003, 2004, 2005, 2007, 2008 [edit] See also Horseracing in Great Britain List of British National Hunt races Categories: National Hunt horse races | Horse races in Great Britain Views Article Discussion Current revision Navigation Main Page Contents Featured content Current events Interaction","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}